app/Controllers/Carrito.php

INSERT INTO `ventas_cabecera` (`fecha`, `usuario_id`, `total_venta`) VALUES ('2025-06-17 05:14:15', '10', 600000)
---
    public function comprar()
    {
        $cart = \Config\Services::cart();
        $items = $cart->contents();

        if (empty($items)) {
            return redirect()->to(site_url('productos'));
        }

        $cabeceraModel = new Ventas_cabecera();
        $detalleModel  = new Ventas_detalle();

        $total = $cart->getTotal();

        // ID del usuario (fijo 1 si no está logueado)
        $idUsuario = session()->get('id_usuario') ?? 1;

        // Insertar en ventas_cabecera y obtener el ID generado
        $ventaId = $cabeceraModel->insert([
            'fecha'      => date('Y-m-d H:i:s'),
            'usuario_id' => $idUsuario,
            'total_venta'=> $total
        ]);

SELECT `ventas_detalle`.*, `productos`.`nombre_prod` AS `nombre_producto`
FROM `ventas_detalle`
JOIN `productos` ON `productos`.`id_producto` = `ventas_detalle`.`producto_id`
WHERE `ventas_id` = 9
---
        // Obtener detalle completo con nombre producto para la vista
        $db = \Config\Database::connect();
        $builder = $db->table('ventas_detalle');
        $detalleVenta = $builder
            ->select('ventas_detalle.*, productos.nombre_prod AS nombre_producto')
            ->join('productos', 'productos.id_producto = ventas_detalle.producto_id')
            ->where('ventas_id', $ventaId)
            ->get()
            ->getResultArray();

SELECT *
FROM `ventas_cabecera`
WHERE `usuario_id` = '10'
ORDER BY `fecha` DESC
---
    public function misCompras()
{
    $idUsuario = session()->get('id_usuario') ?? 1; // Reemplazar por el ID de sesión real si tenés login

    $cabeceraModel = new \App\Models\Ventas_cabecera();

    $ventas = $cabeceraModel
        ->where('usuario_id', $idUsuario)
        ->orderBy('fecha', 'DESC')
        ->findAll();

SELECT `ventas_detalle`.*, `productos`.`nombre_prod` AS `nombre_producto`
FROM `ventas_detalle`
JOIN `productos` ON `productos`.`id_producto` = `ventas_detalle`.`producto_id`
WHERE `ventas_id` = '8'
---
    public function detalleCompra($id)
{
    $detalleModel = new \App\Models\Ventas_detalle();

    $db = \Config\Database::connect();
    $builder = $db->table('ventas_detalle');

    $detalles = $builder
        ->select('ventas_detalle.*, productos.nombre_prod AS nombre_producto')
        ->join('productos', 'productos.id_producto = ventas_detalle.producto_id')
        ->where('ventas_id', $id)
        ->get()
        ->getResultArray();