app/Controllers/Carrito.php

UPDATE `productos` SET `stock` = 0
WHERE `productos`.`id_producto` IN ('1')
---
        // Actualizar stock si el producto existe
        if ($producto && isset($producto['stock'])) {
            $nuevoStock = $producto['stock'] - $item['qty'];
            $this->productoModel->update($item['id'], ['stock' => $nuevoStock]);

SELECT *
FROM `ventas_cabecera`
WHERE `usuario_id` = '10'
ORDER BY `fecha` DESC
---
public function misCompras()
{
    $idUsuario = session()->get('id_usuario') ?? 1;
    $cabeceraModel = new Ventas_cabecera();

    $ventas = $cabeceraModel
        ->where('usuario_id', $idUsuario)
        ->orderBy('fecha', 'DESC')
        ->findAll();