app/Controllers/Carrito.php

INSERT INTO `ventas_detalle` (`ventas_id`, `producto_id`, `cantidad`, `precio`) VALUES (9, '6', 1, 35000)
---
public function comprar()
{
    $cart = \Config\Services::cart();
    $items = $cart->contents();

    if (empty($items)) {
        return redirect()->to(site_url('productos'));
    }

    $cabeceraModel = new Ventas_cabecera();
    $detalleModel  = new Ventas_detalle();

    $total = $cart->total();

    $idUsuario = session()->get('id_usuario') ?? 1;

    $ventaId = $cabeceraModel->insert([
        'fecha'       => date('Y-m-d H:i:s'),
        'usuario_id'  => $idUsuario,
        'total_venta' => $total
    ]);

    if (!$ventaId) {
        $ventaId = $cabeceraModel->getInsertID();
    }

    foreach ($items as $item) {
        $detalleModel->insert([
            'ventas_id'   => $ventaId,
            'producto_id' => $item['id'],
            'cantidad'    => $item['qty'],
            'precio'      => $item['price']
        ]);

SELECT *
FROM `ventas_cabecera`
WHERE `usuario_id` = '10'
ORDER BY `fecha` DESC
---
public function misCompras()
{
    $idUsuario = session()->get('id_usuario') ?? 1;
    $cabeceraModel = new Ventas_cabecera();

    $ventas = $cabeceraModel
        ->where('usuario_id', $idUsuario)
        ->orderBy('fecha', 'DESC')
        ->findAll();