app/Controllers/ProductoController.php

SELECT *
FROM `categorias`
WHERE `activo` = 1
SELECT `productos`.*, `categorias`.`descripcion` AS `nombre_cat`
FROM `productos`
LEFT JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`categoria_id`
WHERE `productos`.`eliminado` = 'no'
---
    public function index($categoria_id = null)
    {
        $categoriaModel = new \App\Models\categoria_Model();
        $categorias = $categoriaModel->where('activo', 1)->findAll();
        $request = \Config\Services::request();
        // Si viene por GET, tomar el filtro de la URL
        $categoria_id = $request->getGet('categoria_id') ?? $categoria_id;
        $db = \Config\Database::connect();
        $builder = $db->table('productos');
        $builder->select('productos.*, categorias.descripcion AS nombre_cat');
        $builder->join('categorias', 'categorias.id_categoria = productos.categoria_id', 'left');
        $builder->where('productos.eliminado', 'no');
        if ($categoria_id) {
            $builder->where('productos.categoria_id', $categoria_id);
        }
        $productos = $builder->get()->getResultArray();