app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`, `perfil_id`, `baja`) VALUES ('Leo', 'Lopez', 'Leo', 'leo@gmail.com', '$2y$10$9ROuOO5Lcu6CbPTVC8cIf.lniC7PPC2nMM/gl3vfJNNmFSkhUD9Hq', 2, 'NO')
---
    public function index()
    {
        helper(['form']);

        // Reglas de validación
        $rules = [
            'nombre'   => 'required|min_length[3]',
            'apellido' => 'required|min_length[3]',
            'usuario'  => 'required|is_unique[usuarios.usuario]',
            'email'    => 'required|valid_email|is_unique[usuarios.email]',
            'pass'     => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            // Si no pasa la validación, mostrar formulario SOLO con return view (no echo view)
            return view('registro', [
                'validation' => $this->validator
            ]);
        } else {
            // Si pasa validación, guardar usuario
            $usuarioModel = new usuario_Model();

            $usuarioModel->save([
                'nombre'     => $this->request->getVar('nombre'),
                'apellido'   => $this->request->getVar('apellido'),
                'usuario'    => $this->request->getVar('usuario'),
                'email'      => $this->request->getVar('email'),
                'pass'       => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),
                'perfil_id'  => 2, // Valor por defecto si aplica
                'baja'       => 'NO'  // Usuario activo por defecto
            ]);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '14'
---
    public function perfil()
    {
        $idUsuario = session()->get('id_usuario');
        $usuarioModel = new usuario_Model();
        $usuario = $usuarioModel->find($idUsuario);